###############################################################################
# Formulae (CLI tools installed into ~/.homebrew/bin)
###############################################################################
brew "asdf"                     # runtime version manager
brew "starship"                 # prompt
brew "zoxide"                   # smart cd
brew "fzf"                      # fuzzy finder
brew "ripgrep"                  # fast grep
brew "fd"                       # find replacement
brew "eza"                      # modern ls
brew "bat"                      # cat with syntax
brew "gh"                       # GitHub CLI
brew "python@3.12"              # Python 3.12
brew "git"                      # git CLI tools
brew "chezmoi"                  # dot-file manager (self-host)
brew "uv"                       # package manager for Python
brew "fontconfig"              # font configuration library for better font management
brew "mas"                     # Mac App Store CLI
# brew "bun"  # Cannot be installed via Homebrew, intalled by run_once_install_other.sh

###############################################################################
# Casks (GUI apps / fonts)
###############################################################################
cask_args appdir: "~/Applications"  # keep GUI apps in your user folder
cask "warp"                         # Warp terminal
cask "font-hack-nerd-font"
cask "font-fira-code-nerd-font"
cask "warp"
cask "raycast"
cask "1password"
# cask "tailscale"  # Requires system components; see README for manual install
cask "vivaldi"
cask "visual-studio-code"
cask "windsurf"
cask "obsidian"
cask "orbstack"
cask "ollama"
cask "vlc"
cask "keka"
# cask "gifski"  # Could not be installed via Homebrew, install manually
# cask "screens"  # Homebrew only provides Screens 4; install Screens 5 manually (see README)
cask "proton-drive"
cask "proton-mail"
cask "protonvpn"

###############################################################################
# Mac App Store apps (installed via mas)
###############################################################################
# Note: You need to be signed in to the Mac App Store for these to work
# This is automated by run_once_setup_mas.sh which detects your Apple ID
mas "Tailscale", id: 1475387142
mas "Gifski", id: 1351639930
mas "SimpleLogin", id: 1494359858
mas "Screens 5- VNC Remote Desktop", id: 1663070235
