###############################################################################
# Formulae (CLI tools installed into ~/.homebrew/bin)
###############################################################################
tap "jundot/omlx", "https://github.com/jundot/omlx"

brew "asdf"                     # runtime version manager
brew "starship"                 # prompt
brew "zoxide"                   # smart cd
brew "fzf"                      # fuzzy finder
brew "ripgrep"                  # fast grep
brew "fd"                       # find replacement
brew "eza"                      # modern ls
brew "bat"                      # cat with syntax
brew "gh"                       # GitHub CLI
brew "python@3.12"              # Python 3.12
brew "git"                      # git CLI tools
brew "node"                     # Node.js runtime for OpenClaw CLI
brew "chezmoi"                  # dot-file manager (self-host)
brew "uv"                       # package manager for Python
brew "omlx"                     # local MLX inference server
brew "fontconfig"              # font configuration library for better font management
brew "mas"                     # Mac App Store CLI
brew "powershell"              # PowerShell shell and scripting language
brew "tmux"                    # terminal multiplexer
brew "coreutils"               # GNU core utilities
brew "czkawka"                 # duplicate file utility
brew "ffmpeg"                  # media conversion and processing tools
# brew "bun"  # Cannot be installed via Homebrew, intalled by run_once_install_other.sh

###############################################################################
# Casks (GUI apps / fonts)
###############################################################################
cask_args appdir: "~/Applications"  # keep GUI apps in your user folder
cask "warp"                         # Warp terminal
cask "font-hack-nerd-font"
cask "font-fira-code-nerd-font"
cask "warp"
cask "raycast"
cask "1password"
# cask "tailscale"  # Requires system components; see README for manual install
cask "vivaldi"
cask "visual-studio-code"
cask "windsurf"
cask "obsidian"
cask "orbstack"
cask "ollama"
cask "vlc"
cask "keka"
cask "ghostty"
cask "claude"
cask "ditto"
cask "slack"
cask "forklift"
# cask "gifski"  # Could not be installed via Homebrew, install manually
# cask "screens"  # Homebrew only provides Screens 4; install Screens 5 manually (see README)
cask "proton-drive"
cask "proton-mail"
cask "protonvpn"

###############################################################################
# Mac App Store apps (installed via mas)
###############################################################################
# Note: You need to be signed in to the Mac App Store app for these to work
# Homebrew Bundle attempts these installs during `brew bundle`
# If they are skipped or fail, sign in to App Store.app and rerun:
#   brew bundle --file="$HOME/.local/share/chezmoi/Brewfile"
mas "Tailscale", id: 1475387142
mas "Gifski", id: 1351639930
mas "Screens 5: VNC Remote Desktop", id: 1663047912
mas "CoffeeTime -Anti Sleep App", id: 6743958600
